# Package & data

In [2]:
import pandas as pd
import numpy as np

In [3]:
## NBA games data

player_data = pd.read_csv("../data/raw/NBA_Players_stats_since_1950/player_data.csv")

In [4]:
display(player_data.head())
display(player_data.info())
display(player_data.nunique())
display(player_data.isnull().sum())
display(player_data.duplicated().sum())

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4550 entries, 0 to 4549
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        4550 non-null   object
 1   year_start  4550 non-null   int64
 2   year_end    4550 non-null   int64
 3   position    4549 non-null   object
 4   height      4549 non-null   object
 5   weight      4544 non-null   float64
 6   birth_date  4519 non-null   object
 7   college     4248 non-null   object
dtypes: float64(1), int64(2), object(5)
memory usage: 284.5+ KB

None

name          4500
year_start      72
year_end        72
position         7
height          28
weight         143
birth_date    4161
college        473
dtype: int64

name            0
year_start      0
year_end        0
position        1
height          1
weight          6
birth_date     31
college       302
dtype: int64

0

In [5]:
unique_start_positions = player_data["position"].unique()
print(unique_start_positions)

['F-C' 'C-F' 'C' 'G' 'F' 'G-F' 'F-G' nan]